---
kind: type
id: T:Autodesk.Revit.DB.ConnectorElement
source: html/cd7d7579-1058-e8ca-d55a-c3a914843667.htm
---
# Autodesk.Revit.DB.ConnectorElement

A base class that provides support for all connector elements occurring in families.

## Syntax (C#)
```csharp
public class ConnectorElement : Element,
	IConnector
```